# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [4]:
# # import libraries here
# import pandas as pd
# import matplotlib.pyplot as plt
# %matplotlib inline
# import sys
# !{sys.executable} -m pip install plotly.express
# import plotly.express as px
# import seaborn as sns

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [7]:
# your code here
temp = pd.read_csv('/Users/ajiacovic/Downloads/Temp_states.csv')

#### Print `temp`.

In [6]:
# your code here
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [8]:
# your code here
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [ ]:
"""
your comments here:
From the printed dataframe we can see that there are categorical (cities,states) 
and numerical data(temperature)
The numerical data has a 'float' type and the categorical an 'object' type
"""

#### Select the rows where state is New York.

In [12]:
# your code here
temp1 = temp.loc[temp['State']== 'New York']
temp1

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [13]:
# your code here
temp1.mean()
'''The average temp of the cities in New York is 10.74 
(I assume here that the data is in Celsius due to the range of the data -Fahrenheit 
temperature would be higher...)
'''

Temperature    10.740741
dtype: float64

#### Which states and cities have a temperature above 15 degrees Celsius?

In [26]:
# your code here
temp2 = temp.loc[temp['Temperature']> 15]
temp2.State.unique()
''' States with a temperature higher than 15deg celsius are NewYork, Conneticut and New Jersey'''

array(['New York', 'Connecticut', 'New Jersey'], dtype=object)

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [28]:
# your code here
temp2.City.unique()

array(['NYC', 'Hartford', 'Treton', 'Newark'], dtype=object)

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [35]:
# your code here
temp3 = temp2.loc[temp2['Temperature']<20]
temp3
temp3['City'].unique()

array(['NYC', 'Hartford'], dtype=object)

#### Find the mean and standard deviation of the temperature of each state.

In [48]:
# your code here
print(temp.groupby(['State']).mean())
print(temp.groupby(['State']).std())

             Temperature
State
Connecticut    15.833333
New Jersey     21.111111
New York       10.740741
             Temperature
State
Connecticut     1.964186
New Jersey      1.571348
New York        8.133404

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [49]:
# your code here
employees = pd.read_csv('/Users/ajiacovic/Downloads/Employee.csv')
employees

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### Explore the data types of the `employees` dataframe. Comment your results.

In [54]:
# your code here
employees.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

In [ ]:
"""
your comments here
Most of the data is categorical (Name,Department,Education,Gender,Title)
The numerical data is set to inegers. This seems to be ok with the number of years but 
looks strange for the column salary, and the disply is also stange (unless is expressed in tousands...)
"""

#### What's the average salary in this company?

In [60]:
# your code here
employees['Salary'].mean()
''' The average salary  is 48.8. I assume here that the values are in K EUR'''

48.888888888888886

#### What's the highest salary?

In [61]:
# your code here
employees['Salary'].max()
'''Max salary is 70 (K EUR)'''

70

#### What's the lowest salary?

In [62]:
# your code here
employees['Salary'].min()
'''Min salary is 30 (K EUR)'''

30

#### Who are the employees with the lowest salary?

In [66]:
# your code here
employees.loc[employees['Salary']==employees['Salary'].min()]
'''Employees with the min salary are Maria and David'''

    Name Department Education Gender    Title  Years  Salary
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find all the information about an employee called David.

In [67]:
# your code here
employees.loc[employees['Name']== 'David']

    Name Department Education Gender    Title  Years  Salary
2  David         HR    Master      M  analyst      2      30

#### Could you return only David's salary?

In [68]:
# your code here
employees['Salary'].loc[employees['Name']=='David']
'''Yes'''

2    30
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [72]:
# your code here
emp_associate = employees.loc[employees['Title']=='associate']

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [70]:
# Method 1
# your code here
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [71]:
# Method 2
# your code here
employees.iloc[:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [73]:
# your code here
emp_associate.loc[emp_associate['Salary']>55]

    Name Department Education Gender      Title  Years  Salary
7  Pedro         IT       Phd      M  associate      7      60

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [75]:
# your code here
employees.groupby(['Years']).mean()

          Salary
Years
1      35.000000
2      38.333333
3      55.000000
4      35.000000
7      60.000000
8      70.000000

####  What is the average salary per title?

In [76]:
# your code here
employees.groupby(['Title']).mean()

           Years     Salary
Title
VP          8.00  70.000000
analyst     2.25  32.500000
associate   4.00  56.666667

####  Find the salary quartiles.

In [84]:
# your code here
print(employees.groupby(['Salary']).describe()) #groupped by salaries
employees['Salary'].describe()

       Years
       count mean       std  min   25%  50%   75%  max
Salary
30       2.0  2.0  0.000000  2.0  2.00  2.0  2.00  2.0
35       2.0  2.5  2.121320  1.0  1.75  2.5  3.25  4.0
55       2.0  2.5  0.707107  2.0  2.25  2.5  2.75  3.0
60       1.0  7.0       NaN  7.0  7.00  7.0  7.00  7.0
70       2.0  8.0  0.000000  8.0  8.00  8.0  8.00  8.0

count     9.000000
mean     48.888889
std      16.541194
min      30.000000
25%      35.000000
50%      55.000000
75%      60.000000
max      70.000000
Name: Salary, dtype: float64

#### Is the mean salary different per gender?

In [77]:
# your code here
employees.groupby(['Gender']).mean()
'''Yes'''

        Years  Salary
Gender
F         4.0    47.5
M         4.2    50.0

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [104]:
# your code here
employees.groupby(['Department'])['Years','Salary'].agg(['mean','min','max'])

<ipython-input-104-f2e9aa0f6ae5>:2: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  employees.groupby(['Department'])['Years','Salary'].agg(['mean','min','max'])

               Years         Salary
                mean min max   mean min max
Department
HR          4.666667   2   8  45.00  30  70
IT          4.500000   1   8  48.75  30  70
Sales       2.500000   2   3  55.00  55  55

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [108]:
# your code here

employees.groupby(['Department'])['Years','Salary'].agg(lambda x: max(x) - min(x))

<ipython-input-108-2d1849395e05>:3: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  employees.groupby(['Department'])['Years','Salary'].agg(lambda x: max(x) - min(x))

            Years  Salary
Department
HR              6      40
IT              7      40
Sales           1       0

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [109]:
# your code here
orders = pd.read_csv('/Users/ajiacovic/Downloads/Orders.csv')
orders

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
397919,541904,581587,22613,2011,12,5,12,pack of 20 spaceboy napkins,12,2011-12-09 12:50:00,0.85,12680,France,10.20
397920,541905,581587,22899,2011,12,5,12,children's apron dolly girl,6,2011-12-09 12:50:00,2.10,12680,France,12.60
397921,541906,581587,23254,2011,12,5,12,childrens cutlery dolly girl,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397922,541907,581587,23255,2011,12,5,12,childrens cutlery circus parade,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397923,541908,581587,22138,2011,12,5,12,baking set 9 piece retrospot,3,2011-12-09 12:50:00,4.95,12680,France,14.85

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [110]:
# your code here
''' Is the purchase price the amount price spent?'''

orders.amount_spent.mean()

22.394748504739596

#### What are the highest and lowest purchase prices?

In [113]:
# your code here
orders['amount_spent'].agg(['min','max'])

min         0.0
max    168469.6
Name: amount_spent, dtype: float64

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [120]:
# your code here
orders_spain = orders.loc[orders['Country']=='Spain']
orders['CustomerID'].loc[orders['Country']=='Spain'].unique()
orders_spain

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
4250,6421,536944,22383,2010,12,5,12,lunch bag suki design,70,2010-12-03 12:20:00,1.65,12557,Spain,115.50
4251,6422,536944,22384,2010,12,5,12,lunch bag pink polkadot,100,2010-12-03 12:20:00,1.45,12557,Spain,145.00
4252,6423,536944,20727,2010,12,5,12,lunch bag black skull.,60,2010-12-03 12:20:00,1.65,12557,Spain,99.00
4253,6424,536944,20725,2010,12,5,12,lunch bag red retrospot,70,2010-12-03 12:20:00,1.65,12557,Spain,115.50
4254,6425,536944,20728,2010,12,5,12,lunch bag cars blue,100,2010-12-03 12:20:00,1.45,12557,Spain,145.00
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
394733,535271,581193,23291,2011,12,3,17,dolly girl childrens cup,2,2011-12-07 17:05:00,1.25,17097,Spain,2.50
394734,535272,581193,85232D,2011,12,3,17,set/3 decoupage stacking tins,1,2011-12-07 17:05:00,4.95,17097,Spain,4.95
394735,535273,581193,22721,2011,12,3,17,set of 3 cake tins sketchbook,2,2011-12-07 17:05:00,1.95,17097,Spain,3.90
394736,535274,581193,23241,2011,12,3,17,treasure tin gymkhana design,1,2011-12-07 17:05:00,2.08,17097,Spain,2.08
394737,535275,581193,23247,2011,12,3,17,biscuit tin 50's christmas,1,2011-12-07 17:05:00,2.89,17097,Spain,2.89

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here